weekday_dates = ['2024-11-04', '2024-11-05']
holiday_dates = ['2024-11-09', '2024-11-10']

category_codes = {
    '전체': 0,
    '모텔': 1,
    '호텔': 2,  # 호텔, 리조트
    '펜션': 3,
    '홈&빌라': 15,
    '캠핑': 5,
    '게하': 6  # 게스트하우스, 한옥
}

facilities_dict = {
    "모텔": {
        "파티룸": False,
        "수영장": False,
        "야외 테라스": False
    },
    "호텔": {
        "주차장": False,
        "24시간 프론트": False
    },
    "리조트": {
        "바베큐": False,
        "노래방": False,
        "사우나": False
    },
    "캠핑": {
        "바베큐": False,
        "노래방": False,
        "사우나": False
    }
}

region_dict = {
    "경기": "%EA%B2%BD%EA%B8%B0",
    "제주도": "%EC%A0%9C%EC%A3%BC%EB%8F%84",
    "충남": "%EC%B6%A9%EB%82%A8",
    "인천": "%EC%9D%B8%EC%B2%9C",
    "대구": "%EB%8C%80%EA%B5%AC",
    "대전": "%EB%8C%80%EC%A0%84",
    "서울": "%EC%84%9C%EC%9A%B8",
    "경남": "%EA%B2%BD%EB%82%A8",
    "부산": "%EB%B6%80%EC%82%B0",
    "전북": "%EC%A0%84%EB%B6%81",
    "울산": "%EC%9A%B8%EC%82%B0",
    "광주": "%EA%B4%91%EC%A3%BC",
    "강원": "%EA%B0%95%EC%9B%90",
    "경북": "%EA%B2%BD%EB%B6%81",
    "전남": "%EC%A0%84%EB%82%A8",
    "충북": "%EC%B6%A9%EB%B6%81",
    "세종": "%EC%84%B8%EC%A2%85",
}